Repository: yplassiard/nvda-webservices
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar, fr, tr

source: Web Services
fr: Services

source: {service} disconnected
fr: {service} déconnecté

source: {service.name} ready
fr: {service.name} prêt

source: No service registered
fr: Aucun service enregistré

source: Controlling {self._currentService}
fr: Contrôle de {self._currentService}

source: Off
fr: Désactivé

source: Toggles the WebService control interface on or off
fr: Active ou désactive l'interface de contrôle des services

source: Switch to the previous webservice
fr: Basculer vers le service précédent

source: No menu for this service
fr: Aucun menu pour ce service

source: Select previous menu for the active service
fr: Menu précédent du service actif

source: Select next menu for the active service
fr: Menu suivant du service actif

source: No menu selected
fr: Aucun menu sélectionné

source: Speaks the current menu name
fr: énoncer le nom du menu actif

source: Focus the previous menu item
fr: élément de menu précédent

source: Focus the next menu item
fr: élément de menu suivant

source: Speaks the selected menu item
fr: énoncer l'élément de menu actuellement sélectionné

source: Activates this menu item
fr: Action sur l'élément de menu sélectionné

source: Refreshes the interface
fr: raffraîchir l'interface

source: disabled
fr: désactivé

source: Stream status: unknown
fr: état du streaming: inconnu

source: Recording status: unknown
fr: état de l'enregistrement: inconnu

source: Scenes
fr: Scènes

source: Status
fr: état

source: Stream Status:
fr: état du Streaming:

source: streaming
fr: diffusion

source: disconnected
fr: déconnecté

source: Reconnecting
fr: Reconnexion

source: {outSkippedFrames} skipped frames
fr: {outSkippedFrames} images sautées

source: Record Status:
fr: état de l'enregistrement:

source: recording
fr: enregistrement en cours

source: off
fr: désactivé

source: time: {outTimecode}
fr: temps écoulé: {outTimecode}

source: Web Services control from NVDA
fr: Contrôle de services depuis NVDA

source: Controls web services directly from NVDA
fr: Contrôler des services directement depuis NVDA

source: row %s
ar: الصف %s
tr: satır %s

source: through %s
ar: من خلال %s
tr: %s boyunca

source: column %s
ar: العمود %s
tr: sütun %s

source: through row {row} column {column}
ar: من خلال الصف {row} عمود {column}
tr: satır {row} sütun {column} boyunca

source: with {rowCount} rows and {columnCount} columns
ar: {rowCount} الصفوف و {columnCount} الأعمدة
tr: {rowCount} satır ve {columnCount} sütunlu

source: with %s columns
ar: مع %s الأعمدة
tr: %s sütunlu

source: with %s rows
ar: مع %s الصفوف
tr: %s satırlı

source: {number} of {total}
ar: {number} من {total}
tr: {number} bölü {total}

source: level %s
ar: مستوى %s
tr: seviye %s

source: Translate
ar: ترجمة
tr: Tercüme

source: Translation enabled.
ar: تمكين الترجمة.
tr: Çeviri etkin

source: Translation disabled.
ar: تعطيل الترجمة.
tr: Çeviri devre dışı

source: Enables translation to the desired language.
ar: تُمكن الترجمة الى اللغة المطلوبة.
tr: İstenen dile tercümeyi etkinleştirir

source: Press twice to delete all cached translations for all applications.
tr: Tüm uygulamalar için önbelleğe alınmış tüm çevirileri silmek için iki kez basın.

source: All translations have been deleted.
tr: Tüm çeviriler silindi.

source: Some caches failed to be removed.
tr: Önbellekdeki bazı şeyler silinemedi.

source: Remove all cached translations for all applications.
tr: Tüm uygulamalar için önbelleğe alınmış tüm çevirileri sil.

source: No focused application
tr: Odaklanmış uygulama yok

source: Press twice to delete all translations for {app}
tr: {app} için önbellekteki tüm çevirileri sil

source: Error while deleting application's translation cache.
tr: Uygulamanın çeviri önbelleği silinirken hata oluştu.

source: Translation cache for {app} has been deleted.
tr: {app} için çeviri önbelleği silindi.

source: No saved translations for {app}
tr: {app} için Kayıtlı çeviri yok

source: Remove translation cache for the currently focused application
tr: Odaklanan uygulama için çeviri önbelleğini sil

source: Uses the Google Translate API to translate each spoken text to the desired language, on the fly. This add-on requires an internet connection.
ar: يستخدم واجهة برمجة تطبيقات الترجمة من Google لترجمة كل نص منطوق إلى اللغة المطلوبة ، على الفور. هذه الإضافة تتطلب الإنتر نت.
